001_Конспекты_notes/src/Catalogs/Ленты/Ленты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ленты</name>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комментарии</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЛентыФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <comment>width</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <comment>height</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Якорь</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_notes/src/Catalogs/Ленты/Forms/ФормаРедактирования/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗначениеЗаполнено(ВведенныйТекст) Тогда
		СтруктураПараметров = Новый Структура("ВведенныйТекст, Тэг, НомерСтроки, Якорь, Вставка", ВведенныйТекст, Тэг, НомерСтроки, Якорь, ЭтоВставка);
		ОповеститьОВыборе(СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Комментарий") Тогда
		ВведенныйТекст = Параметры.Комментарий;
	КонецЕсли;
	
	Если Параметры.Свойство("Тэг") Тогда
		Тэг = Параметры.Тэг;
	КонецЕсли;
	
	Если Параметры.Свойство("НомерСтроки") Тогда
		НомерСтроки = Параметры.НомерСтроки;
	КонецЕсли;

	Если Параметры.Свойство("Якорь") Тогда
		Якорь = Параметры.Якорь; 
	КонецЕсли; 
	
	Если Параметры.Свойство("Вставка") Тогда
		ЭтоВставка = Параметры.Вставка; 
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Тэг) Тогда
		Тэг = Справочники.Тэги.p;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	ВведенныйТекст = СтрЗаменить(ВведенныйТекст, ВыбранноеЗначение.ТекстДо, ВыбранноеЗначение.ТекстПосле); 
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРедактировать(Команда)		
	СтрутураПараметров = Новый Структура;
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	СтрутураПараметров.Вставить("Комментарий", 		ВыделенныйТекст); 	
		
	ОткрытьФорму("Справочник.Ленты.Форма.ФормаВводаТекста", СтрутураПараметров, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаЖирный(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ТекстВставки = ВыделенныйТекст;
	ТекстВставки = ОбщийHTMLКлиент.КомандаЖирный(ТекстВставки); 
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаКурсив(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ТекстВставки = ВыделенныйТекст;
	ТекстВставки = ОбщийHTMLКлиент.КомандаКурсив(ТекстВставки); 
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПеречеркнутый(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ТекстВставки = ВыделенныйТекст;
	ТекстВставки = ОбщийHTMLКлиент.КомандаПеречеркнутый(ТекстВставки); 
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодчеркнутый(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ТекстВставки = ВыделенныйТекст;
	ТекстВставки = ОбщийHTMLКлиент.КомандаПодчеркнутый(ТекстВставки); 
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазрывСтроки(Команда)
	ВыделенныйТекст = Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст;
	ТекстВставки = ВыделенныйТекст;
	ТекстВставки = ОбщийHTMLКлиент.КомандаРазрывСтроки(ТекстВставки); 
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЛиния(Команда)
	ВведенныйТекст = "<hr>";
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗнакМеньше(Команда)
	ТекстВставки = "&lt ";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗнакБольше(Команда)
	ТекстВставки = " &gt";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСоздатьНумерованныйСписок(Команда)
//	ТекстВставки = "<ol> <li></li> </ol>";
//	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = "";
//	Элементы.ВведенныйТекстРасширеннаяПодсказка.Родитель.ВыделенныйТекст = ТекстВставки;
КонецПроцедуры
#КонецОбласти
